[
  {
    "src": "uru-shop.gif",
    "title": "Uru-Shop",
    "link": "https://github.com/RobertBattaglia/uru-shop",
    "desc": "e-commerce store created with React and Redux on a team of 4 developers. Styled using Material-UI and styled-components. Used Travis for CI and Jest for testing. I was responsible for Product Overview Component as seen in the image."
  },
  {
    "src": "build-a-bogo.gif",
    "title": "Build-a-Bogo",
    "link": "https://buildabogo.com",
    "desc": "e-commerce store written in React and Redux, with serverless backend. I added Google Analytics to the application and an AWS Lambda function to calculate sales tax for the Stripe order. Upvote us on <a href=\"https://producthunt.com/posts/build-a-bogo\" target=\"_blank\" rel=\"noopener noreferrer\">Product Hunt!</a>"
  },
  {
    "src": "todos.gif",
    "title": "Todos",
    "link": "https://todos.robertbattaglia.com",
    "desc": "Todo Application using Facebook Login API to persist data on Mongo Atlas DB. Also using localstorage to persist across browser sessions."
  },
  {
    "src": "triva.gif",
    "title": "Triva",
    "link": "https://triva.robertbattaglia.com",
    "desc": "Trivia game using React and a <a href=\"https://opentdb.com/\" target=\"_blank\" rel=\"noopener noreferrer\">third party API</a>. Employing browsers' localstorage API to store recent scores on the client."
  },
  {
    "src": "spear-qa.png",
    "title": "Spear-QA",
    "link": "https://github.com/RobertBattaglia/spear-qa",
    "desc": "Microservice for the questions and answers part of the Uru-Shop backend. Deployed across AWS EC2s with Docker Swarm. Used Express for application layer, PostgreSQL for data layer and Redis for caching."
  },
  {
    "src": "twiddler.gif",
    "title": "Twiddler",
    "link": "https://tw1ddler.herokuapp.com",
    "desc": "Twitter clone created with just jQuery, vanilla Javascript and CSS. Random tweets are generated from a Javascript script on the client side."
  },
  {
    "src": "crypto-chart.png",
    "title": "Crypto Chart",
    "link": "http://crypt0-chart.herokuapp.com/",
    "desc": "Chart displaying Bitcoin's average daily price over the last 30 days. Powered by <a href=\"https://coindesk.com\" target=\"_blank\" rel=\"noopener noreferrer\">Coindesk.</a>"
  },
  {
    "src": "minesweeper.gif",
    "title": "Minesweeper",
    "link": "https://github.com/RobertBattaglia/minesweeper",
    "desc": "Responsive 10x10 minesweeper board with React and Redux. Redux Sagas are used to trigger square checks adjacent to clicked square."
  },
  {
    "src": "github-fetcher.gif",
    "title": "Github Fetcher",
    "link": "https://github-repository-fetcher.herokuapp.com/",
    "desc": "Allows user to fetch top Github repos sorted by stargazer count. Users can delete a repo by clicking on the garbage icon. Data persists on a MongoDB database and is globally viewable."
  }
]
